class ConfigSettings:
    '''
    Класс ConfigSettings содержит конфигурационные переменные для использования во всем приложении.

    Atributes:
        :ftp_remote_path_44_fz (str): путь до ftp сервера ЕИС по 44-ФЗ, к папкам, которые содержат данные
         о торгах по регионам;
        :atr xml_zip_local_director (str): путь до папки, содержащей ZIP архивы документов XML;
        :atr xml_unpacked_local_directory (str): путь до папки для распакованных документов XML;
        :atr xml_zip_local_directory (str): путь до папки содержащей ZIP архивы документов XML
        :atr zip_archive_local_directory (str): путь до папки, содержащей ZIP архивы документов, скачанных с ЕИС;
        :atr unpacked_output_local_directory (str): нпуть до папки для распакованных ZIP архивов документов PDF;
        :atr inn_set (list): набор ИНН для первичного условия парсинга файлов XML;
        :atr set_okpd (list): набор данных по ОКПД для первичного условия парасинга файлов XML;
        :atr start_date: дата, начиная с которой скачиваем архивы с FTP ЕИС.

    Methods:
        get_config_value(key): Возвращает значение конфигурационной переменной по ключу.
    '''

    # Определение удаленного пути и даты для фильтрации файлов
    zip_archive_local_directory = r'C:\Users\wangr\OneDrive\Документы\тест парсера закупок\архив_проектов'
    unpacked_output_local_directory = r'C:\Users\wangr\OneDrive\Документы\тест парсера закупок\разархивированные_документы_торги'
    xml_zip_local_directory = r'C:\Users\wangr\OneDrive\Документы\тест парсера закупок\архив_xml_тест'
    xml_unpacked_local_directory = r'C:\Users\wangr\OneDrive\Документы\тест парсера закупок\разархивированные_xml'
    xml_positive_file_directory = r'C:\Users\wangr\OneDrive\Документы\тест парсера закупок\позитивный файл xml'
    set_okpd = ["71", "71.1", "71.11.2", "71.11.21", "71.11.21.000", "71.11.22", "71.11.22.000", "71.11.23",
                "71.11.24", "71.12", "71.12.1", "71.12.12", "71.12.13", "71.12.14", "71.12.19", "41", "41.1", "41.10",
                "41.10.1", "41.10.10.000", "41.2", "41.20", "41.20.1", "41.20.10", "41.20.10.110", "41.20.10.120",
                "41.20.10.130", "41.20.10.140", "41.20.10.190", "41.20.2", "41.20.20", "41.20.3", "41.20.30",
                "41.20.4", "41.20.40", "42", "42.1", "42.11", "42.11.1", "42.11.10", "42.11.2", "42.11.20",
                "42.12", "42.12.1", "42.12.10", "42.12.2", "42.12.20", "42.13", "42.13.1", "42.13.10", "42.13.2",
                "42.13.20", "42.9", "42.91", "42.91.1", "42.91.10", "42.91.10.160", "42.91.10.130", "42.91.2",
                "42.91.20"
                ]
    start_date = '20220101'  # Дата в формате 'YYYYMMDD'

    @staticmethod
    def get_config_value(key):
        '''
        Возвращает значение конфигурационной переменной по ключу.
        Params:
            :param key (str): Имя конфигурационной переменной.
        return:
            Значение переменной, если она существует, иначе None.
        '''
        return getattr(ConfigSettings, key, None)